.minemacs.d/config.org
#+title: GB's minEmacs Config
#+description: My personal minEmacs Configuration
#+property: header-args:emacs-lisp :tangle ./config.el :mkdirp yes
#+options: num:nil
#+auto_tangle: t

* Table of Contents :TOC:
- [[#about-this-config][ABOUT THIS CONFIG]]
  - [[#why-emacs][Why Emacs]]
- [[#gui-changes][GUI CHANGES]]
  - [[#theme][Theme]]
  - [[#title-bar][Title Bar]]
  - [[#fonts][Fonts]]
  - [[#doom-modeline][Doom-Modeline]]
  - [[#menu-bar-mode][Menu-bar-mode]]
  - [[#dashboard][Dashboard]]
  - [[#word-wrap][Word Wrap]]
- [[#personal-settings][PERSONAL SETTINGS]]
  - [[#general-keybindings][General Keybindings]]
  - [[#setting-username-and-e-mail][Setting Username and E-Mail]]
  - [[#rainbow-mode][Rainbow Mode]]
  - [[#setting-the-default-link-opener][Setting the Default Link Opener]]
  - [[#elfeed][Elfeed]]
  - [[#use-package][Use-package]]
  - [[#osx-reveal-in-finder][OSX Reveal in Finder]]
  - [[#yeetube][Yeetube]]
  - [[#bookmarks][Bookmarks]]
- [[#org-mode][ORG-MODE]]
  - [[#org-settings][Org-Settings]]
  - [[#org-fonts][Org-fonts]]
  - [[#org-agenda][Org-agenda]]
  - [[#org-capture][Org-capture]]
  - [[#org-export][Org-export]]
  - [[#org-auto-tangle][Org-auto-tangle]]
  - [[#org-novelist][Org-Novelist]]
  - [[#toc-org][Toc-Org]]
  - [[#org-superstar][Org-Superstar]]
  - [[#org-cliplink][Org-Cliplink]]
  - [[#org-contrib][Org-contrib]]
  - [[#org-insert-item][org-insert-item]]
  - [[#source-code-block-tag-expansion][Source Code Block Tag Expansion]]
- [[#writing-stuff][WRITING STUFF]]
  - [[#typing-practice][Typing Practice]]
  - [[#novel][Nov.el]]
  - [[#olivetti][Olivetti]]
  - [[#palimpsest-mode][Palimpsest-Mode]]
  - [[#abbrev-mode][Abbrev-Mode]]
  - [[#yasnippet][YAsnippet]]
  - [[#magit][Magit]]
  - [[#spell-checker][Spell Checker]]
  - [[#thesarus][Thesarus]]
- [[#reading-stuff][Reading Stuff]]
  - [[#nov][Nov]]
- [[#eshell][ESHELL]]
  - [[#aliases][Aliases]]
  - [[#prompt][Prompt]]
- [[#ai-assiants][AI ASSIANTS]]
  - [[#ellama][Ellama]]
  - [[#chatgpt-shell][Chatgpt-Shell]]
- [[#social-media][SOCIAL MEDIA]]
  - [[#mastodon][Mastodon]]
  - [[#lemmy][Lemmy]]
- [[#dired][DIRED]]
- [[#coding][CODING]]
  - [[#nix-mode][Nix-Mode]]

* ABOUT THIS CONFIG
This is my Doom Emacs Config. I have built this over the last couple of months mainly from DistroTube's config.
#+begin_src emacs-lisp
;;    _____ __          __
;;  / ____| \ \        / / GameWarrior
;; | |  __   \ \  /\  / /  https://github.com/game-warrior
;; | | |_ |   \ \/  \/ /   @gamewarrior010@social.linux.pizza
;; | |__| |    \  /\  /    https://www.gnu.org/software/emacs/
;;  \_____|     \/  \/     https://github.com/abougouffa/minemacs
#+end_src
** Why Emacs
I highly recommend that you checkout this [[https://tecosaur.github.io/emacs-config/config.html][this blog post/config by Tecosaur]] it covers way more about Doom Emacs that I want to here but to quote an excerpt from it.
#+begin_quote
Emacs is not a text editor, this is a common misnomer. It is far more apt to describe Emacs as a Lisp machine providing a generic user-centric text manipulation environment. That’s quite a mouthful. In simpler terms one can think of Emacs as a platform for text-related applications. It’s a vague and generic definition because Emacs itself is generic.

Good with text. How far does that go? A lot further than one initially thinks:

Task planning
File management
Terminal emulation
Email client
Remote server tool
Git frontend
Web client/server
and more…
Ideally, one may use Emacs as the interface to perform input → transform → output cycles, i.e. form a bridge between the human mind and information manipulation.
#+end_quote

* GUI CHANGES
** Theme
#+begin_src emacs-lisp
;; Set a theme for MinEmacs, supported themes include these from `doom-themes'
;; or built-in themes
(setq minemacs-theme 'doom-solarized-dark-high-contrast)
#+end_src
** Title Bar
Change the title bar format
#+begin_src emacs-lisp
(setq frame-title-format "Hey bro, just FYI, this buffer is called %b or something like that.")
#+end_src

** Fonts
MinEmacs defines the variable =minemacs-fonts-plist= that is used by k
=+setup-fonts= function. The function checks and enables the first available
font from these defined in =minemacs-fonts-plist=. This variable can be
customized to set font specs for specific Emacs faces or to enable some
language-specific fonts.
#+begin_src emacs-lisp
(+setup-fonts)
;; You can set a list of fonts to be used, like the snippet below. The first
;; font found on the system will be used:
(plist-put minemacs-fonts-plist
           :default ;; <- applies to the `default' face usig `custom-theme-set-faces'
           '((:family "JuliaMono" :height 130) ; <- priority 1
             (:family "JetBrains Mono" :height 110 :weight light) ; <- priority 2
             (:family "Cascadia Code" :height 120 :weight semi-light))) ; <- priority 3

;; To set font for arbitrary Emacs face, you need just to write the face name as
;; a keyword. For example `variable-pitch' -> `:variable-pitch':
(plist-put minemacs-fonts-plist
           :variable-pitch ;; <- applies to the `variable-pitch' face usig `custom-theme-set-faces'
           '("Lato"
             "Roboto"
             "Inter"
             "Helvetica"))

;; For example to set custom font for `mode-line' -> `:mode-line':
(plist-put minemacs-fonts-plist
           :mode-line ;; <- applies to the `mode-line' face usig `custom-theme-set-faces'
           '((:family "Lato" :weight regular)
             (:family "Roboto" :weight light)))

(plist-put minemacs-fonts-plist
           :mode-line-inactive ;; <- applies to the `mode-line-inactive'
           '((:family "Lato" :weight regular)
             (:family "Roboto" :weight light)))
#+end_src

** Doom-Modeline
The modeline is the bottom status bar that appears in Emacs windows.  For more information on what is available to configure in the Doom modeline, check out:
https://github.com/seagle0128/doom-modeline

#+begin_src emacs-lisp
(set-face-attribute 'mode-line nil :font "Ubuntu Mono-18")
(setq doom-modeline-height 25     ;; sets modeline height
      doom-modeline-bar-width 5   ;; sets right bar width
      doom-modeline-major-mode-icon t  ;; Whether display the icon for `major-mode'. It respects `doom-modeline-icon'.      doom-modeline-persp-name t  ;; adds perspective name to modeline
      doom-modeline-enable-word-count '(markdown-mode gfm-mode org-mode fountain-mode) ;; Show word count
      )
;; (setq doom-modeline-time-icon t)
(setq doom-modeline-buffer-file-name-style 'autotruncate-except-project)

#+end_src

** Menu-bar-mode
#+begin_src emacs-lisp
(menu-bar-mode -1)
#+end_src

** Dashboard
#+begin_src emacs-lisp
(setq dashboard-startup-banner "~/.emacs.d/assets/images/minemacs.svg")
(setq dashboard-center-content t)
(setq dashboard-items '((recents . 5)
                        (agenda . 5 )
                        (bookmarks . 3)))
#+end_src

** Word Wrap
#+begin_src emacs-lisp
(setq word-wrap-mode 1)
#+end_src

* PERSONAL SETTINGS
