.minemacs.d/config.org
** Magit
#+begin_src emacs-lisp
(use-package magit-todos
  :straight t
  :after magit
  :config (magit-todos-mode 1))
#+end_src

** Spell Checker
Jinx is a fast just-in-time spell-checker for Emacs.
#+begin_src emacs-lisp
(use-package jinx
  :straight t
  :hook (emacs-startup . global-jinx-mode))
#+end_src

** Thesarus
Synosaurus is a thesaurus fontend for Emacs with pluggable backends.
#+begin_src emacs-lisp
(use-package synosaurus
  :straight t
  )
#+end_src

* Reading Stuff
** Nov
nov.el provides a major mode for reading EPUB documents
#+begin_src emacs-lisp
(setq nov-unzip-program (executable-find "bsdtar")
      nov-unzip-args '("-xC" directory "-f" filename))
(add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode))
#+end_src

* ESHELL
** Aliases
#+begin_src emacs-lisp
(setq eshell-aliases-file "~/.config/doom/eshell/aliases")
#+end_src
** Prompt
#+begin_src emacs-lisp
(with-eval-after-load "esh-opt"
  (autoload 'epe-theme-lambda "eshell-prompt-extras")
  (setq eshell-highlight-prompt nil
        eshell-prompt-function 'epe-theme-lambda))
#+end_src
* AI ASSIANTS
** Ellama
#+begin_src emacs-lisp
;; (setq ellama-buffer-mode "org-mode")
(use-package ellama
  :straight t
  )
(setopt ellama-language "English")
#+end_src

** Chatgpt-Shell
#+begin_src emacs-lisp
(use-package chatgpt-shell
  :straight t
  :config
  (setq chatgpt-shell-openai-key "placeholder")
  )
#+end_src

* SOCIAL MEDIA
** Mastodon
mastodon.el is an Emacs client for the AcitivityPub social networks that implement the Mastodon API.
#+begin_src emacs-lisp
(use-package mastodon
  :straight t
  :config
  (setq mastodon-instance-url "https://social.linux.pizza"
      mastodon-active-user "Gamewarrior010")
  )
#+end_src
** Lemmy
lem.el is an Emacs client for the federated link aggregator Lemmy.
#+begin_src emacs-lisp
(use-package lem
  :straight t
  :config
(setq lem-instance-url "https://lemmy.world")
(setq lem-current-user "GameWarrior"))
#+end_src
* DIRED
#+begin_src emacs-lisp
(use-package dired-open
  :straight t
  :config
   (setq dired-open-extensions '(("gif" . "sxiv")
                                 ("jpg" . "sxiv")
                                 ("png" . "sxiv")
                                 ("mkv" . "IINA")
                                 ("mp4" . "IINA"))))

(use-package peep-dired
  :straight t
  :after dired
  :hook (evil-normalize-keymaps . peep-dired-hook)
  :config
    (evil-define-key 'normal dired-mode-map (kbd "h") 'dired-up-directory)
    (evil-define-key 'normal dired-mode-map (kbd "l") 'dired-open-file) ; use dired-find-file instead if not using dired-open package
    (evil-define-key 'normal peep-dired-mode-map (kbd "j") 'peep-dired-next-file)
    (evil-define-key 'normal peep-dired-mode-map (kbd "k") 'peep-dired-prev-file)
)

(use-package nerd-icons-dired
  :straight t
  :hook
  (dired-mode . nerd-icons-dired-mode))

(use-package diredfl
  :straight t
  :hook
  (dired-mode . diredfl-mode))



(cond ((eq system-type 'darwin)
       (setq dired-use-ls-dired t
             insert-directory-program "/opt/homebrew/bin/gls"
             dired-listing-switches "-aBhl --group-directories-first")
       ))
#+end_src

* CODING
So I need to program a couple of different languages regularly. Mostly Nix for NixOS and Lua for configuring Awesome WM.
** Nix-Mode
Nix is a cross-platform package manager that uses a deployment model where software is installed into unique directories generated through cryptographic hashes. It is also the name of the tool's programming language. Here are some of the tools that I am using for writing nix.
#+begin_src emacs-lisp
(use-package nix-mode
  :straight t
  )

(use-package ob-nix
  :straight t
  )

(use-package nixpkgs-fmt
  :straight t
  )
#+end_src
