.minemacs.d/config.el

(use-package magit-todos
  :straight t
  :after magit
  :config (magit-todos-mode 1))

(use-package jinx
  :straight t
  :hook (emacs-startup . global-jinx-mode))

(use-package synosaurus
  :straight t
  )

(setq nov-unzip-program (executable-find "bsdtar")
      nov-unzip-args '("-xC" directory "-f" filename))
(add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode))

(setq eshell-aliases-file "~/.config/doom/eshell/aliases")

(with-eval-after-load "esh-opt"
  (autoload 'epe-theme-lambda "eshell-prompt-extras")
  (setq eshell-highlight-prompt nil
        eshell-prompt-function 'epe-theme-lambda))

;; (setq ellama-buffer-mode "org-mode")
(use-package ellama
  :straight t
  )
(setopt ellama-language "English")

(use-package chatgpt-shell
  :straight t
  :config
  (setq chatgpt-shell-openai-key "placeholder")
  )

(use-package mastodon
  :straight t
  :config
  (setq mastodon-instance-url "https://social.linux.pizza"
      mastodon-active-user "Gamewarrior010")
  )

(use-package lem
  :straight t
  :config
(setq lem-instance-url "https://lemmy.world")
(setq lem-current-user "GameWarrior"))

(use-package dired-open
  :straight t
  :config
   (setq dired-open-extensions '(("gif" . "sxiv")
                                 ("jpg" . "sxiv")
                                 ("png" . "sxiv")
                                 ("mkv" . "IINA")
                                 ("mp4" . "IINA"))))

(use-package peep-dired
  :straight t
  :after dired
  :hook (evil-normalize-keymaps . peep-dired-hook)
  :config
    (evil-define-key 'normal dired-mode-map (kbd "h") 'dired-up-directory)
    (evil-define-key 'normal dired-mode-map (kbd "l") 'dired-open-file) ; use dired-find-file instead if not using dired-open package
    (evil-define-key 'normal peep-dired-mode-map (kbd "j") 'peep-dired-next-file)
    (evil-define-key 'normal peep-dired-mode-map (kbd "k") 'peep-dired-prev-file)
)

(use-package nerd-icons-dired
  :straight t
  :hook
  (dired-mode . nerd-icons-dired-mode))

(use-package diredfl
  :straight t
  :hook
  (dired-mode . diredfl-mode))



(cond ((eq system-type 'darwin)
       (setq dired-use-ls-dired t
             insert-directory-program "/opt/homebrew/bin/gls"
             dired-listing-switches "-aBhl --group-directories-first")
       ))

(use-package nix-mode
  :straight t
  )

(use-package ob-nix
  :straight t
  )

(use-package nixpkgs-fmt
  :straight t
  )
